flashsim_result/sysbench/ctoc_noshadow/nontrx_select_t60.out
2018. 12. 19. (수) 23:12:16 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running non-transactional test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            1726736
        write:                           0
        other:                           0
        total:                           1726736
    transactions:                        1726736 (28758.10 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 1726736 (28758.10 per sec.)
    other operations:                    0      (0.00 per sec.)

Test execution summary:
    total time:                          60.0435s
    total number of events:              1726736
    total time taken by event execution: 959.4094
    per-request statistics:
         min:                                  0.04ms
         avg:                                  0.56ms
         max:                                 44.45ms
         approx.  95 percentile:               0.81ms

Threads fairness:
    events (avg/stddev):           107921.0000/92.37
    execution time (avg/stddev):   59.9631/0.02

2018. 12. 19. (수) 23:13:16 KST

--------------------------------------------------------------------

mutex_t : 0x9af8ea8 q:0x9af8ea0, size:2048
mutex_t : 0x9af9478 q:0x9af9470, size:1024
mutex_t : 0x9af94d8 q:0x9af94d0, size:1024
mutex_t : 0x9af9538 q:0x9af9530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 11144 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = -102132568, gearRec = 836642142, aurSend = 345678311, aurRec = -2086407920, readSend=5791228, writeSend=-107224526
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x9b19378 q:0x9b19370, size:1024
mutex_t : 0x9b1fef8 q:0x9b1fef0, size:1024
mutex_t : 0x9b1ff58 q:0x9b1ff50, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!

WAF: 1.01

WAF: 1.01

WAF: 1.00

WAF: 1.00
^C


[cdf]read---
50	1	0.000000
60	3	0.000001
120	14539	0.004199
130	128650	0.041341
140	173105	0.091318
150	123971	0.127109
160	114790	0.160250
170	111568	0.192461
180	92144	0.219063
190	71415	0.239681
200	61587	0.257462
210	58911	0.274470
220	52932	0.289752
230	41696	0.301790
240	34466	0.311741
250	30799	0.320633
260	42591	0.332929
270	87531	0.358200
280	120442	0.392972
290	135666	0.432140
300	146474	0.474429
310	150614	0.517912
320	143517	0.559347
330	136848	0.598856
340	135453	0.637962
350	133613	0.676537
360	123248	0.712120
370	111163	0.744214
380	103313	0.774041
390	95792	0.801697
400	86797	0.826756
410	76347	0.848798
420	66914	0.868116
430	59093	0.885177
440	52628	0.900371
450	46035	0.913662
460	39760	0.925141
470	34674	0.935152
480	29790	0.943752
490	26487	0.951399
500	22736	0.957963
510	19639	0.963633
520	16981	0.968536
530	14561	0.972740
540	12827	0.976443
550	11052	0.979634
560	9543	0.982389
570	8202	0.984757
580	7213	0.986839
590	5962	0.988560
600	5122	0.990039
610	4428	0.991318
620	3933	0.992453
630	3436	0.993445
640	2902	0.994283
650	2544	0.995017
660	2145	0.995637
670	1978	0.996208
680	1539	0.996652
690	1380	0.997051
700	1282	0.997421
710	1069	0.997729
720	947	0.998003
730	732	0.998214
740	714	0.998420
750	546	0.998578
760	497	0.998721
770	413	0.998841
780	363	0.998945
790	318	0.999037
800	292	0.999121
810	236	0.999190
820	216	0.999252
830	164	0.999299
840	135	0.999338
850	143	0.999380
860	114	0.999412
870	85	0.999437
880	97	0.999465
890	69	0.999485
900	64	0.999503
910	52	0.999518
920	41	0.999530
930	44	0.999543
940	30	0.999552
950	41	0.999563
960	36	0.999574
970	26	0.999581
980	34	0.999591
990	24	0.999598
1000	22	0.999604
1010	16	0.999609
1020	15	0.999613
1030	21	0.999619
1040	15	0.999624
1050	19	0.999629
1060	20	0.999635
1070	11	0.999638
1080	14	0.999642
1090	13	0.999646
1100	9	0.999649
1110	3	0.999650
1120	9	0.999652
1130	9	0.999655
1140	12	0.999658
1150	7	0.999660
1160	7	0.999662
1170	6	0.999664
1180	4	0.999665
1190	9	0.999668
1200	9	0.999670
1210	12	0.999674
1220	10	0.999677
1230	1	0.999677
1240	7	0.999679
1250	2	0.999680
1260	2	0.999680
1270	6	0.999682
1300	1	0.999682
1310	4	0.999683
1320	4	0.999684
1330	2	0.999685
1340	3	0.999686
1350	1	0.999686
1360	2	0.999687
1370	2	0.999687
1380	3	0.999688
1390	5	0.999690
1420	1	0.999690
1430	1	0.999690
1440	2	0.999691
1490	4	0.999692
1500	2	0.999692
1510	1	0.999693
1520	4	0.999694
1530	3	0.999695
1540	1	0.999695
1550	2	0.999696
1560	1	0.999696
1570	4	0.999697
1590	5	0.999699
1610	1	0.999699
1640	1	0.999699
1650	3	0.999700
1660	3	0.999701
1670	3	0.999702
1680	3	0.999703
1690	6	0.999704
1700	1	0.999705
1710	4	0.999706
1720	1	0.999706
1730	3	0.999707
1740	6	0.999709
1750	3	0.999710
1760	4	0.999711
1770	3	0.999712
1790	1	0.999712
1800	3	0.999713
1810	2	0.999713
1820	1	0.999714
1830	4	0.999715
1840	1	0.999715
1920	2	0.999716
1940	1	0.999716
1950	5	0.999717
1970	2	0.999718
1980	3	0.999719
1990	1	0.999719
2010	3	0.999720
2030	1	0.999720
2080	2	0.999721
2140	2	0.999721
2150	1	0.999722
2160	1	0.999722
2190	1	0.999722
2230	1	0.999723
2310	1	0.999723
2330	1	0.999723
2380	1	0.999723
2410	1	0.999724
2420	1	0.999724
2430	1	0.999724
2440	2	0.999725
2450	1	0.999725
2480	2	0.999726
2490	1	0.999726
2500	1	0.999726
2510	4	0.999727
2520	1	0.999728
2530	1	0.999728
2540	1	0.999728
2550	2	0.999729
2560	1	0.999729
2590	1	0.999729
2600	1	0.999730
2790	1	0.999730
2800	3	0.999731
2830	1	0.999731
2850	1	0.999731
2860	1	0.999732
2870	4	0.999733
2920	1	0.999733
2930	3	0.999734
2960	1	0.999734
2980	2	0.999735
2990	1	0.999735
3000	1	0.999736
3060	1	0.999736
3080	2	0.999736
3140	1	0.999737
3190	1	0.999737
3690	2	0.999738
3710	1	0.999738
3720	1	0.999738
3780	2	0.999739
3820	2	0.999739
3910	2	0.999740
3920	3	0.999741
3930	1	0.999741
3940	3	0.999742
3960	2	0.999742
3980	2	0.999743
3990	1	0.999743
4000	3	0.999744
4010	3	0.999745
4020	2	0.999746
4030	1	0.999746
4040	2	0.999747
4060	3	0.999747
4100	1	0.999748
4120	1	0.999748
4130	3	0.999749
4140	2	0.999749
4150	2	0.999750
4160	3	0.999751
4180	1	0.999751
4190	1	0.999751
4200	5	0.999753
4210	1	0.999753
4220	5	0.999755
4230	2	0.999755
4240	3	0.999756
4250	1	0.999756
4260	3	0.999757
4270	2	0.999758
4280	2	0.999758
4320	4	0.999759
4330	1	0.999760
4340	2	0.999760
4350	4	0.999762
4360	5	0.999763
4370	1	0.999763
4380	2	0.999764
4390	4	0.999765
4400	3	0.999766
4410	4	0.999767
4440	1	0.999767
4470	2	0.999768
4500	2	0.999768
4510	2	0.999769
4610	1	0.999769
4630	2	0.999770
4640	1	0.999770
4650	1	0.999770
4660	2	0.999771
4680	1	0.999771
4690	2	0.999772
4700	1	0.999772
4760	1	0.999772
4780	1	0.999773
4850	1	0.999773
4870	2	0.999774
4920	3	0.999775
4940	1	0.999775
4990	2	0.999775
5020	2	0.999776
5030	2	0.999777
5040	1	0.999777
5060	1	0.999777
5070	1	0.999777
5090	2	0.999778
5100	1	0.999778
5110	2	0.999779
5120	2	0.999779
5150	1	0.999780
5160	1	0.999780
5170	1	0.999780
5190	1	0.999781
5280	1	0.999781
5310	1	0.999781
5780	2	0.999782
5870	1	0.999782
5880	1	0.999782
5970	2	0.999783
6010	1	0.999783
6020	4	0.999784
6030	1	0.999785
6040	4	0.999786
6070	2	0.999786
6100	2	0.999787
6110	3	0.999788
6120	1	0.999788
6130	1	0.999788
6160	2	0.999789
6170	1	0.999789
6180	1	0.999790
6190	2	0.999790
6200	3	0.999791
6210	1	0.999791
6220	4	0.999792
6230	2	0.999793
6240	3	0.999794
6250	1	0.999794
6260	2	0.999795
6270	1	0.999795
6280	3	0.999796
6290	2	0.999796
6300	1	0.999797
6320	2	0.999797
6330	1	0.999798
6340	1	0.999798
6360	3	0.999799
6370	1	0.999799
6380	1	0.999799
6400	2	0.999800
6410	1	0.999800
6420	4	0.999801
6430	1	0.999802
6440	2	0.999802
6450	3	0.999803
6460	3	0.999804
6470	3	0.999805
6480	2	0.999805
6500	1	0.999806
6520	2	0.999806
6540	1	0.999807
6550	2	0.999807
6560	1	0.999807
6580	3	0.999808
6600	2	0.999809
6630	2	0.999809
6640	3	0.999810
6650	2	0.999811
6660	1	0.999811
6680	1	0.999811
6690	1	0.999812
6710	1	0.999812
6730	1	0.999812
6740	6	0.999814
6750	5	0.999816
6760	3	0.999816
6770	1	0.999817
6780	4	0.999818
6790	1	0.999818
6800	1	0.999818
6810	4	0.999820
6820	8	0.999822
6830	1	0.999822
6840	3	0.999823
6850	3	0.999824
6860	1	0.999824
6870	2	0.999825
6890	1	0.999825
6900	3	0.999826
6910	1	0.999826
6930	1	0.999826
6940	4	0.999828
6950	1	0.999828
6960	1	0.999828
6970	2	0.999829
6980	1	0.999829
6990	1	0.999829
7000	3	0.999830
7010	6	0.999832
7020	2	0.999833
7030	4	0.999834
7040	2	0.999834
7050	5	0.999836
7060	1	0.999836
7070	2	0.999837
7080	1	0.999837
7090	2	0.999837
7100	2	0.999838
7120	1	0.999838
7140	1	0.999839
7160	2	0.999839
7190	2	0.999840
7200	1	0.999840
7220	3	0.999841
7230	1	0.999841
7240	3	0.999842
7250	2	0.999843
7290	1	0.999843
7390	1	0.999843
7400	3	0.999844
7410	1	0.999844
7620	1	0.999845
7630	1	0.999845
7640	1	0.999845
7700	1	0.999846
7710	2	0.999846
7720	1	0.999846
7740	2	0.999847
7760	1	0.999847
7770	1	0.999848
7800	1	0.999848
7810	4	0.999849
7820	2	0.999850
7830	2	0.999850
7860	2	0.999851
7870	1	0.999851
7880	2	0.999852
7890	6	0.999853
7900	10	0.999856
7910	3	0.999857
7920	3	0.999858
7930	1	0.999858
7940	2	0.999859
7960	2	0.999859
8020	2	0.999860
8050	1	0.999860
8060	1	0.999861
8070	4	0.999862
8080	10	0.999865
8100	2	0.999865
8120	1	0.999865
8130	1	0.999866
8210	1	0.999866
8460	1	0.999866
8890	1	0.999867
9040	1	0.999867
9080	1	0.999867
9090	1	0.999867
9370	2	0.999868
9400	1	0.999868
9420	1	0.999869
9440	1	0.999869
9480	2	0.999870
9500	1	0.999870
9530	1	0.999870
9550	1	0.999870
9600	1	0.999871
9610	2	0.999871
9630	1	0.999872
9640	1	0.999872
9650	1	0.999872
9660	2	0.999873
9700	1	0.999873
9730	3	0.999874
9740	1	0.999874
9750	2	0.999875
9770	5	0.999876
9780	2	0.999877
9800	2	0.999877
9810	3	0.999878
9820	1	0.999878
9830	2	0.999879
9840	1	0.999879
9850	2	0.999880
9860	1	0.999880
9870	1	0.999880
9880	1	0.999881
9900	4	0.999882
9920	5	0.999883
9930	5	0.999885
9940	7	0.999887
9950	2	0.999887
9960	3	0.999888
9970	5	0.999890
9980	3	0.999891
9990	1	0.999891
10010	5	0.999892
10020	4	0.999893
10030	7	0.999896
10040	4	0.999897
10050	2	0.999897
10060	5	0.999899
10070	5	0.999900
10080	6	0.999902
10090	7	0.999904
10100	13	0.999908
10110	5	0.999909
10120	8	0.999911
10130	5	0.999913
10140	5	0.999914
10150	4	0.999915
10160	5	0.999917
10170	3	0.999918
10180	8	0.999920
10190	2	0.999921
10200	5	0.999922
10210	8	0.999924
10220	5	0.999926
10230	7	0.999928
10250	8	0.999930
10260	6	0.999932
10270	6	0.999934
10280	7	0.999936
10290	4	0.999937
10300	2	0.999937
10310	6	0.999939
10320	3	0.999940
10330	4	0.999941
10340	7	0.999943
10350	2	0.999944
10360	4	0.999945
10370	3	0.999946
10390	5	0.999947
10400	5	0.999949
10410	3	0.999949
10420	3	0.999950
10430	1	0.999951
10440	1	0.999951
10450	2	0.999951
10460	1	0.999952
10480	2	0.999952
10490	5	0.999954
10500	2	0.999954
10510	3	0.999955
10520	4	0.999956
10530	1	0.999957
10550	2	0.999957
10560	3	0.999958
10570	1	0.999958
10580	3	0.999959
10590	3	0.999960
10610	1	0.999960
10620	2	0.999961
10630	1	0.999961
10640	1	0.999962
10650	2	0.999962
10660	3	0.999963
10670	2	0.999964
10680	1	0.999964
10710	2	0.999964
10740	1	0.999965
10790	1	0.999965
10800	2	0.999966
10810	1	0.999966
10830	1	0.999966
10880	2	0.999967
10930	3	0.999968
10950	3	0.999969
10970	1	0.999969
11010	3	0.999970
11050	1	0.999970
11060	3	0.999971
11070	1	0.999971
11080	4	0.999972
11090	1	0.999973
11100	1	0.999973
11110	2	0.999973
11120	2	0.999974
11130	2	0.999975
11140	1	0.999975
11150	1	0.999975
11170	5	0.999977
11190	1	0.999977
11200	1	0.999977
11210	1	0.999977
11220	3	0.999978
11270	1	0.999979
11310	4	0.999980
11340	1	0.999980
11450	2	0.999981
11460	1	0.999981
11480	1	0.999981
11490	1	0.999982
11500	1	0.999982
11530	1	0.999982
11540	2	0.999983
11550	2	0.999983
11560	6	0.999985
11570	2	0.999986
11580	2	0.999986
11590	1	0.999986
11600	2	0.999987
11610	4	0.999988
11620	1	0.999988
11630	2	0.999989
11640	1	0.999989
11660	2	0.999990
11680	1	0.999990
11810	2	0.999991
11840	2	0.999991
11880	2	0.999992
11890	1	0.999992
11900	1	0.999992
11950	1	0.999993
11970	4	0.999994
11980	1	0.999994
12040	2	0.999995
12060	1	0.999995
12070	2	0.999996
12140	1	0.999996
12150	1	0.999996
12160	1	0.999997
12170	1	0.999997
12190	1	0.999997
12200	2	0.999998
12210	1	0.999998
12400	1	0.999998
12410	1	0.999999
12770	1	0.999999
15760	1	0.999999
17310	1	0.999999
17900	1	1.000000
19110	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	57	0	7.571	35	0.00101%
1	0	12040	119	178.270	2367523	68.35230%
2	0	19114	275	843.943	512	0.01478%
3	0	12192	247	366.540	1095667	31.63280%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 74417.429688(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 0, 0.000000
[cache hit cnt,ratio dftl] 0, 0.000000
[READ WRITE CNT] 3463706 6061694
error cnt:117
result of ms:
---
bye bye!
# of gc: 0
# of translation page gc: 0
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 1098181
# of buf hit: 4
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 0
Cache miss on read: 0
Cache hit on write: 6050882
Cache miss on write: 3006

Clean hit on read: 1839014
Dirty hit on read: 528509
Clean hit on write: 20
Dirty hit on write: 6050862

% of miss : 0.10
# Clean eviction: 1095667
# Dirty eviction: 2514

Clean eviciton on read: 1095667
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 2514

Dirty eviction ratio: 0.23%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.00

0 0
1 1096207
2 2514
3 0
4 0
5 3463702
6 6053888
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:10647	read_q_hit:0	retry_hit:0